Revit 2027 API
ExternalServices.BuiltInExternalServices.DuctPressureDropService Property
 The external service which permits registration of an alternate implementation for duct pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctPressureDropServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId DuctPressureDropService { get; }
Public Shared ReadOnly Property DuctPressureDropService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ DuctPressureDropService {
	ExternalServiceId^ get ();
}
static member DuctPressureDropService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace